Table of Contents
 Class IntIdentifier<T>
Namespace
IdeaStatiCa.BimApiLink.Identifiers
Assembly
IdeaStatiCa.BimApiLink.dll
public class IntIdentifier<T> : ImmutableIdentifier<T>, IIdentifier, IIdeaPersistenceToken, IEquatable<IIdentifier> where T : IIdeaObject
Type Parameters
T
Inheritance
object
Identifier<T>
ImmutableIdentifier<T>
IntIdentifier<T>
Implements
IIdentifier
IIdeaPersistenceToken
IEquatable<IIdentifier>
Inherited Members
 ImmutableIdentifier<T>.GetStringId()
 Identifier<T>.ObjectType
 Identifier<T>.Equals(IIdentifier)
 Identifier<T>.Equals(object)
 Identifier<T>.GetHashCode()
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IntIdentifier(int)
public IntIdentifier(int id)
Parameters
id int
 IntIdentifier(int, string)
protected IntIdentifier(int id, string typeName)
Parameters
id int
typeName string
Properties
 Id
public int Id { get; }
Property Value
int
Methods
 GetId()
public override object GetId()
Returns
object
 Edit this page